# **NOTEBOOK FOR UNDERSTANDING THE `OLIST` DATASET**

- ***We need to check tables,relationships and which are important tables for our analysis, we can not use all tables***

### **Creating Connection with the Database**

In [1]:
import sys, os
sys.path.append(os.path.abspath(r"C:\Users\Rano's PC\Machine\github_repo_cloned\my-personal-projects\olist review analysis"))
import pandas as pd
import numpy as np
from sqlalchemy import create_engine,text

import src.functions as F

In [2]:
engine = F.get_engine()

In [3]:
engine

Engine(mysql+pymysql://root:***@localhost:3306/olist_shopping_dataset)

### **Checking all the tables**

In [7]:
tables = F.sql("show tables in olist_shopping_dataset",engine)
tables = [c[0] for c in tables.values]

In [8]:
for name in tables:
    print(f'Table: {name}')
    query = f''' select * from {name}
            limit 1;
        '''
    display(F.sql(query,engine))
    print("_"*50)

Table: olist_customers_dataset

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP

__________________________________________________
Table: olist_geolocation_dataset

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP

__________________________________________________
Table: olist_order_items_dataset

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.9,13.29

__________________________________________________
Table: olist_order_payments_dataset

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33

__________________________________________________
Table: olist_order_reviews_dataset

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,None,None,2018-01-18 00:00:00,2018-01-18 21:46:59

__________________________________________________
Table: olist_orders_dataset

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00

__________________________________________________
Table: olist_products_dataset

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0

__________________________________________________
Table: olist_sellers_dataset

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,campinas,SP

__________________________________________________
Table: product_category_name_translation

  product_category_name product_category_name_english
0          beleza_saude                 health_beauty

__________________________________________________

In [9]:
df={}
for name in tables:
    query = f''' select count(*) as total_rows from {name};
        '''
    df[name] = F.sql(query).iloc[0,0]
pd.DataFrame.from_dict(df,orient='index',columns=['total_rows'])

                                   total_rows
olist_customers_dataset                 99441
olist_geolocation_dataset             1000163
olist_order_items_dataset              112650
olist_order_payments_dataset           103886
olist_order_reviews_dataset             99224
olist_orders_dataset                    99441
olist_products_dataset                  32951
olist_sellers_dataset                    3095
product_category_name_translation          71

In [10]:
F.select('olist_customers_dataset')

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

In [11]:
F.sql('select count(distinct customer_id) as total_cust_id, count(distinct customer_unique_id) as total_unique_id,count(*) as total_rows from olist_customers_dataset')

   total_cust_id  total_unique_id  total_rows
0          99441            96096       99441

***`customer_id` is the primary key of `customers` table, unique id represent id of the customer***

In [12]:
F.select('olist_geolocation_dataset')

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP

In [13]:
query = '''
    select count(distinct geolocation_zip_code_prefix) as total_zips,
    count(distinct geolocation_lat) as total_lats,
    count(distinct geolocation_lng) as total_lns,
    count(*) as total_rows 
    from olist_geolocation_dataset
'''

F.sql(query)

   total_zips  total_lats  total_lns  total_rows
0       19015      717360     717613     1000163

***`gelocation` table do not have any primary keys***

***this table indicates lat and lon of some pin codes with duplicate values***

In [14]:
F.select('olist_order_items_dataset')

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [16]:
F.sql('select count(distinct order_item_id) as total_unique_order_items from olist_order_items_dataset')

   total_unique_order_items
0                        21

In [21]:
query = '''
    select count(distinct order_id) as total_order_id,
    count(distinct product_id) as total_product_id,
    count(distinct seller_id) as total_seller_id,
    count(*) as total_rows
    from olist_order_items_dataset
'''
F.sql(query)

   total_order_id  total_product_id  total_seller_id  total_rows
0           98666             32951             3095      112650

***`order_items` dataset do not have any primary id***

***it holds the information about each items information in each orders***

In [17]:

F.select('olist_order_payments_dataset')

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [18]:
query = '''
    with duplicate as (
    select order_id,payment_type, row_number() over(partition by order_id,payment_type) as rn from olist_order_payments_dataset)
    select * from duplicate
    where rn >1
'''
F.sql(query).head()

                           order_id payment_type  rn
0  002f19a65a2ddd70a090297872e6d64e      voucher   2
1  0071ee2429bc1efdc43aa3e073a5290e      voucher   2
2  009ac365164f8e06f59d18a08045f6c4      voucher   2
3  009ac365164f8e06f59d18a08045f6c4      voucher   3
4  009ac365164f8e06f59d18a08045f6c4      voucher   4

In [19]:
query = '''
    select count(distinct order_id) as total_order_id,
    count(*) as total_rows
    from olist_order_payments_dataset
'''
F.sql(query)

   total_order_id  total_rows
0           99440      103886

***`payments` table uses multiple scenario where payment was made for any particular order, table contains no primary key as such***

In [20]:
F.select('olist_order_reviews_dataset')

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,None,None,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,None,None,2018-03-10 00:00:00,2018-03-11 03:05:13
2,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,None,None,2018-02-17 00:00:00,2018-02-18 14:36:24
3,e64fb393e7b32834bb789ff8bb30750e,658677c97b385a9be170737859d3511b,5,None,Recebi bem antes do prazo estipulado.,2017-04-21 00:00:00,2017-04-21 22:02:06
4,f7c4243c7fe1938f181bec41a392bdeb,8e6bfb81e283fa7e4f11123a3fb894f1,5,None,Parabns lojas lannister adorei comprar pela I...,2018-03-01 00:00:00,2018-03-02 10:26:53

In [21]:
query = '''
    select count(distinct review_id) as total_review_id,
    count(distinct order_id) as total_order_id,
    count(*) as total_rows
    from olist_order_reviews_dataset
'''
F.sql(query)

   total_review_id  total_order_id  total_rows
0            98410           98673       99224

In [22]:
query = '''
    with duplicate as (
    select order_id, count(*) as `count`
    from olist_order_reviews_dataset
    group by order_id)
    select * from duplicate
    where count >1
    order by count desc
'''
F.sql(query).head()

                           order_id  count
0  c88b1d1b157a9999ce368f218a407141      3
1  df56136b8031ecd28e200bb18e6ddb2e      3
2  03c939fd7fd3b38f8485a0f95798f1f6      3
3  8e17072ec97ce29f0e1f111e598b0c85      3
4  cf73e2cb1f4a9480ed70c154da3d954a      2

In [23]:
query = '''
    with duplicate as (
    select review_id, count(*) as `count`
    from olist_order_reviews_dataset
    group by review_id)
    select * from duplicate
    where count >1
    order by count desc
'''
F.sql(query).head()

                          review_id  count
0  c444278834184f72b1484dfe47de7f97      3
1  308316408775d1600dad81bd3184556d      3
2  2d6ac45f859465b5c185274a1c929637      3
3  3415c9f764e478409e8e0660ae816dd2      3
4  4219a80ab469e3fc9901437b73da3f75      3

In [24]:
query = '''
    with duplicate as (
    select *, row_number() over(partition by review_id,review_creation_date,review_answer_timestamp) as rn from olist_order_reviews_dataset)
    select review_id from duplicate
    where rn > 1
'''
duplicate_review_id = F.sql(query)

In [25]:
ids = "','".join(duplicate_review_id['review_id'])
formatted = f"('{ids}')"

In [26]:
query = f'''
    select * from olist_order_reviews_dataset
    where review_id in {formatted}
    order by review_id desc
'''
F.sql(query).head()

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,ffb8cff872a625632ac983eb1f88843c,c44883fc2529b4aa03ca90e7e09d95b6,3,None,None,2017-07-22 00:00:00,2017-07-26 13:41:07
1,ffb8cff872a625632ac983eb1f88843c,c88b1d1b157a9999ce368f218a407141,3,None,None,2017-07-22 00:00:00,2017-07-26 13:41:07
2,ff2fc9e68f8aabfbe18d710b83aabd30,2da58e0a7dcfa4ce1e00fad9d03ca3b5,2,None,None,2018-03-17 00:00:00,2018-03-19 11:44:15
3,ff2fc9e68f8aabfbe18d710b83aabd30,1078d496cc6ab9a8e6f2be77abf5091b,2,None,None,2018-03-17 00:00:00,2018-03-19 11:44:15
4,fe5c833752953fed3209646f1f63b53c,4863e15fa53273cc7219c58f5ffda4fb,1,None,"Comprei dois produtos e ambos, mesmo enviados ...",2018-02-28 00:00:00,2018-02-28 13:57:52

**There are some scenarios, where multiple reviews are given per order**

**There are some duplicate review id**

In [27]:
F.select('olist_orders_dataset')

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [28]:
query = '''
    select count(distinct order_id) as total_order_id,
    count(distinct customer_id) as total_customer_id,
    count(*) as total_rows
    from olist_orders_dataset
'''
F.sql(query)

   total_order_id  total_customer_id  total_rows
0           99441              99441       99441

***`customer_id` from `orders` table is the reference from `customer id` of `customer` table***

***`customer id` and `order id` both can be treated as primary key***

In [29]:
F.select('olist_products_dataset')

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

In [30]:
query = '''
    select count(distinct product_id) as total_product_id,
    count(*) as total_rows
    from olist_products_dataset
'''
F.sql(query)

   total_product_id  total_rows
0             32951       32951

***`product id` is the primary key for this table***

***holds the information about each product***

In [31]:
F.select('olist_sellers_dataset')

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,campinas,SP
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,mogi guacu,SP
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,rio de janeiro,RJ
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,sao paulo,SP
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,braganca paulista,SP

In [32]:
query = '''
    select count(distinct seller_id) as total_seller_id,
    count(*) as total_rows
    from olist_sellers_dataset
'''
F.sql(query)

   total_seller_id  total_rows
0             3095        3095

***contains the informatin about each seller***

***`seller id` is the primary key***

In [33]:
F.select('product_category_name_translation')

    product_category_name product_category_name_english
0            beleza_saude                 health_beauty
1  informatica_acessorios         computers_accessories
2              automotivo                          auto
3         cama_mesa_banho                bed_bath_table
4        moveis_decoracao               furniture_decor

In [34]:
query = '''
    select count(distinct product_category_name) as total_categories,
    count(*) as total_rows
    from product_category_name_translation
'''
F.sql(query)

   total_categories  total_rows
0                71          71

***contains the english name of each product category***

### **So for our REVIEW ANALYSIS project we do not need all the values and all the tables**

**what we need is ->**

- from `customers` table - the `city` of the customer

- from `order_items` table - how many `product_id`, `total price`, `total freight`, if used multiple `seller_id`

- from `order_payments` table - how many `sequence_payment` used,how many `payment_type` used,how many `installments` used, total paid `payment_value`

- we will use `reviews` table as main table, but only use `review_id`, `order_id`, `review_score`, `review_creation_date` columns

- from `order` table - what is the `status` ,`approval_delay`,`delivery_days`, how many days late delivery

**special scenario, we need to merge orders and products table, fetch total weight,length,height,width to calculate some measurement in each order,and how many categories were ordered in that order**

- from `seller` table - the `city` of the seller

### **Creating backup tables**

In [35]:
df = {
    'olist_customers_dataset' : 'customers',
    'olist_order_items_dataset' : 'order_items',
    'olist_order_payments_dataset': 'order_payments',
    'olist_order_reviews_dataset' : 'order_reviews',
    'olist_orders_dataset' : 'orders',
    'olist_products_dataset' : 'products',
    'olist_sellers_dataset' : 'sellers'
}

In [36]:
for table in df.items():
    print(table[0],table[1])

olist_customers_dataset customers
olist_order_items_dataset order_items
olist_order_payments_dataset order_payments
olist_order_reviews_dataset order_reviews
olist_orders_dataset orders
olist_products_dataset products
olist_sellers_dataset sellers

In [37]:
for table in df.items():
    query = f'''
        create table {table[1]} like {table[0]}
    '''
    F.run(query)
    query = f'''
    insert into {table[1]} select * from {table[0]}
    '''
    F.run(query)